updating docs with proper links
